# PhyMaterialParamShearPerpendicular Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PhyMaterialParamShearPerpendicular Property
ParameterTypeId Class See Also
---
"Shear perpendicular to grain"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PhyMaterialParamShearPerpendicular { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PhyMaterialParamShearPerpendicular As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PhyMaterialParamShearPerpendicular {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace